// 投票页面
// 1. 拦截验证
//  1.1 需输入认证码
//  1.2 后台查询返回结果
//  1.3 进入或退出
//   1.3.1 认证码错误 -> 提示信息 "认证码错误，请勿恶意尝试"，退出页面
//   1.3.2 认证码正确，投票主题错误 -> 提示信息 "您的投票主题链接错误，请点击 ?? 进行投票" 跳转投票
//   1.3.3 认证码正确，已投过票 -> 提示信息 "该认证码已失效，仅可用于查看投票信息"，显示目前结果
//   1.3.4 认证成功 -> 进入投票页面
// 2. 投票操作
//  2.1 进行选择，获取选择
//  2.2 对选项数据进行加密
//  2.3 异步发送到远程数据库，本地通过 store 或 缓存 进行修改

<template>
    <div>

    </div>
</template>

<script>
    export default {
        name: 'Vote',
        data(){
            return {

            }
        },
        methods: {

        },
        created(){
            
        }
    }
</script>

<style lang="scss" scoped>

</style>